Revit 2024 API
Face.Triangulate Method
Returns a triangular mesh approximation to the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Mesh Triangulate()
Visual Basic
Public Function Triangulate As Mesh
Visual C++
public:
Mesh^ Triangulate()
Remarks
Tolerance of approximation is defined internally by Revit to be adequate for display purposes.
Examples
CopyC#
private void TriangulateFace(Face face)
{
    // Get mesh
    Mesh mesh = face.Triangulate();
    for (int i = 0; i < mesh.NumTriangles; i++)
    {
        MeshTriangle triangle = mesh.get_Triangle(i);
        XYZ vertex1 = triangle.get_Vertex(0);
        XYZ vertex2 = triangle.get_Vertex(1);
        XYZ vertex3 = triangle.get_Vertex(2);
    }
}
CopyVB.NET
Private Sub TriangulateFace(face As Face)
    ' Get mesh
    Dim mesh As Mesh = face.Triangulate()
    For i As Integer = 0 To mesh.NumTriangles - 1
        Dim triangle As MeshTriangle = mesh.Triangle(i)
        Dim vertex1 As XYZ = triangle.Vertex(0)
        Dim vertex2 As XYZ = triangle.Vertex(1)
        Dim vertex3 As XYZ = triangle.Vertex(2)
    Next
End Sub
See Also
Face Class
Triangulate Overload
Autodesk.Revit.DB Namespace